In [5]:
# 1. Importing Dataset:
import pandas as pd
df = pd.read_csv('csv.csv')
print(df.to_string())

     ID      NAME   AGE     SEX   MARKS1   MARKS2       PLACE
0    10    sachin    24    male       90       95  Shikaripur
1    12    Ganesh    26    male       60       85      Mysore
2    13    herish    23  female       90       25   Bangalore
3    24    Suresh    22    male       70       15        Pune
4    25      hmyy    21  female       90       55     Shimoga
5   101      John    20    male       85       90    New York
6   102  Samantha    19  female       78       85      London
7   103     David    21    male       90       80      Sydney
8   104     Emily    22  female       92       95       Paris
9   105   Michael    20    male       80       88       Tokyo
10  106     Alice    21  female       86       90   Singapore
11  107   William    19    male       79       83     Beijing
12  108    Olivia    20  female       91       95      Berlin
13  109   Matthew    22    male       88       89        Rome
14  110  Isabella    19  female       82       84      Mumbai

In [7]:
# 2. Cleaning the Data
#display first and last 5 rows
import pandas as pd

df = pd.read_csv('csv.csv')
print("First 5 rows:")
print(df.head())

print("Last 5 rows:")
print(df.tail())

First 5 rows:
   ID    NAME   AGE     SEX   MARKS1   MARKS2       PLACE
0  10  sachin    24    male       90       95  Shikaripur
1  12  Ganesh    26    male       60       85      Mysore
2  13  herish    23  female       90       25   Bangalore
3  24  Suresh    22    male       70       15        Pune
4  25    hmyy    21  female       90       55     Shimoga
Last 5 rows:
     ID      NAME   AGE     SEX   MARKS1   MARKS2      PLACE
10  106     Alice    21  female       86       90  Singapore
11  107   William    19    male       79       83    Beijing
12  108    Olivia    20  female       91       95     Berlin
13  109   Matthew    22    male       88       89       Rome
14  110  Isabella    19  female       82       84     Mumbai

In [8]:
#display max rows
import pandas as pd
print(pd.options.display.max_rows)

60

In [13]:
import pandas as pd
pd.options.display.max_rows=10
df = pd.read_csv("csv.csv")
print(df)

     ID      NAME   AGE     SEX   MARKS1   MARKS2       PLACE
0    10    sachin    24    male       90       95  Shikaripur
1    12    Ganesh    26    male       60       85      Mysore
2    13    herish    23  female       90       25   Bangalore
3    24    Suresh    22    male       70       15        Pune
4    25      hmyy    21  female       90       55     Shimoga
..  ...       ...   ...     ...      ...      ...         ...
10  106     Alice    21  female       86       90   Singapore
11  107   William    19    male       79       83     Beijing
12  108    Olivia    20  female       91       95      Berlin
13  109   Matthew    22    male       88       89        Rome
14  110  Isabella    19  female       82       84      Mumbai

[15 rows x 7 columns]

In [14]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       15 non-null     int64
 1    NAME    15 non-null     object
 2    AGE     15 non-null     int64
 3    SEX     15 non-null     object
 4    MARKS1  15 non-null     int64
 5    MARKS2  15 non-null     int64
 6    PLACE   15 non-null     object
dtypes: int64(4), object(3)
memory usage: 968.0+ bytes
None

In [16]:
import pandas as pd
df = pd.read_csv("csv.csv")
newdf = df.dropna()
print(newdf.to_string())
#it will remove dup values from the csv file

     ID      NAME   AGE     SEX   MARKS1   MARKS2       PLACE
0    10    sachin    24    male       90     95.0  Shikaripur
1    12    Ganesh    26    male       60     85.0      Mysore
2    13    herish    23  female       90     25.0   Bangalore
3    24    Suresh    22    male       70     15.0        Pune
4    25      hmyy    21  female       90     55.0     Shimoga
5   101      John    20    male       85     90.0    New York
6   102  Samantha    19  female       78     85.0      London
7   103     David    21    male       90     80.0      Sydney
8   104     Emily    22  female       92     95.0       Paris
9   105   Michael    20    male       80     88.0       Tokyo
10  106     Alice    21  female       86     90.0   Singapore
12  108    Olivia    20  female       91     95.0      Berlin
13  109   Matthew    22    male       88     89.0        Rome

In [31]:
# 3. Data frame manipulation using Numpy
import pandas as pd
import numpy as np
data = {'name': ['Alice', 'Bob', 'Charles', 'David', 'Eric'],
        'year': [2017, 2017, 2017, 2017, 2017],
        'salary': [40000, 24000, 31000, 20000, 30000]}
data1 = pd.DataFrame({'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
                      'subject_id':['sub2','sub4','sub3','sub6','sub5'],
                      'Marks_scored':[89,80,79,97,88]})
df = pd.DataFrame(data, index = ['Acme', 'Acme', 'Bilbao', 'Bilbao', 'Bilbao'])
print(df)

           name  year  salary
Acme      Alice  2017   40000
Acme        Bob  2017   24000
Bilbao  Charles  2017   31000
Bilbao    David  2017   20000
Bilbao     Eric  2017   30000

In [33]:
# Filtering option:
df_filtered = df.query('salary>30000')
print(df_filtered)

           name  year  salary
Acme      Alice  2017   40000
Bilbao  Charles  2017   31000

In [34]:
df_filtered = df[(df.salary >= 30000) & (df.year == 2017)]
print(df_filtered)

           name  year  salary
Acme      Alice  2017   40000
Bilbao  Charles  2017   31000
Bilbao     Eric  2017   30000